cmsis-svd/cmsis-svd/data/Spansion/MB9BF32xM.svd
        <!-- REGISTER "I2C_FBYTE2" -->
        <register>
          <name>I2C_FBYTE2</name>
          <description>FIFO Byte Register 2</description>
          <alternateGroup>I2C</alternateGroup>
          <addressOffset>0x19</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "I2C_EIBCR" -->
        <register>
          <name>I2C_EIBCR</name>
          <description>Extension I2C Bus Control Register</description>
          <alternateGroup>I2C</alternateGroup>
          <addressOffset>0x1D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0C</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SDAS" -->
            <field>
              <name>SDAS</name>
              <description>SDA status bit</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCLS" -->
            <field>
              <name>SCLS</name>
              <description>SCL status bit</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDAC" -->
            <field>
              <name>SDAC</name>
              <description>SDA output control bit </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCLC" -->
            <field>
              <name>SCLC</name>
              <description>SCL output control bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOCE" -->
            <field>
              <name>SOCE</name>
              <description>Serial output enabled bit </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BEC" -->
            <field>
              <name>BEC</name>
              <description>Bus error control bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "MFS1" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS1</name>
      <baseAddress>0x40038100</baseAddress>
      <!-- INTERRUPT "MFS1RX" -->
      <interrupt>
        <name>MFS1RX</name>
        <value>9</value>
      </interrupt>
      <!-- INTERRUPT "MFS1TX" -->
      <interrupt>
        <name>MFS1TX</name>
        <value>10</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS2" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS2</name>
      <baseAddress>0x40038200</baseAddress>
      <!-- INTERRUPT "MFS2RX" -->
      <interrupt>
        <name>MFS2RX</name>
        <value>11</value>
      </interrupt>
      <!-- INTERRUPT "MFS2TX" -->
      <interrupt>
        <name>MFS2TX</name>
        <value>12</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS3" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS3</name>
      <baseAddress>0x40038300</baseAddress>
      <!-- INTERRUPT "MFS3RX" -->
      <interrupt>
        <name>MFS3RX</name>
        <value>13</value>
      </interrupt>
      <!-- INTERRUPT "MFS3TX" -->
      <interrupt>
        <name>MFS3TX</name>
        <value>14</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS4" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS4</name>
      <baseAddress>0x40038400</baseAddress>
      <!-- INTERRUPT "MFS4RX" -->
      <interrupt>
        <name>MFS4RX</name>
        <value>15</value>
      </interrupt>
      <!-- INTERRUPT "MFS4TX" -->
      <interrupt>
        <name>MFS4TX</name>
        <value>16</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS5" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS5</name>
      <baseAddress>0x40038500</baseAddress>
      <!-- INTERRUPT "MFS5RX" -->
      <interrupt>
        <name>MFS5RX</name>
        <value>17</value>
      </interrupt>
      <!-- INTERRUPT "MFS5TX" -->
      <interrupt>
        <name>MFS5TX</name>
        <value>18</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS6" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS6</name>
      <baseAddress>0x40038600</baseAddress>
      <!-- INTERRUPT "MFS6RX" -->
      <interrupt>
        <name>MFS6RX</name>
        <value>19</value>
      </interrupt>
      <!-- INTERRUPT "MFS6TX" -->
      <interrupt>
        <name>MFS6TX</name>
        <value>20</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS7" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS7</name>
      <baseAddress>0x40038700</baseAddress>
      <!-- INTERRUPT "MFS7RX" -->
      <interrupt>
        <name>MFS7RX</name>
        <value>21</value>
      </interrupt>
      <!-- INTERRUPT "MFS7TX" -->
      <interrupt>
        <name>MFS7TX</name>
        <value>22</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "RTC" -->
    <peripheral>
      <name>RTC</name>
      <description>REAL-TIME CLOCK</description>
      <groupName>RTC</groupName>
      <baseAddress>0x4003B000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x13</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x15</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x19</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x24</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x28</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2C</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "WTCR1" -->
        <register>
          <name>WTCR1</name>
          <description>Control Register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF1F7D</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INTCRIE" -->
            <field>
              <name>INTCRIE</name>
              <description>Year/month/date/hour/minute/second/day of the week counter value read completion interrupt enable bit</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTERIE" -->
            <field>
              <name>INTERIE</name>
              <description>Time rewrite error interrupt enable bit </description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTALIE" -->
            <field>
              <name>INTALIE</name>
              <description>Alarm interrupt enable bit </description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTTMIE" -->
            <field>
              <name>INTTMIE</name>
              <description>Timer interrupt enable bit</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTHIE" -->
            <field>
              <name>INTHIE</name>
              <description>1-hour interrupt enable bit </description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTMIE" -->
            <field>
              <name>INTMIE</name>
              <description>1-minute interrupt enable bit </description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTSIE" -->
            <field>
              <name>INTSIE</name>
              <description>1-second interrupt enable bit</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTSSIE" -->
            <field>
              <name>INTSSIE</name>
              <description>0.5-second interrupt enable bit</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTCRI" -->
            <field>
              <name>INTCRI</name>
              <description>Year/month/date/hour/minute/second/day of the week counter value read completion interrupt flag bit</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTERI" -->
            <field>
              <name>INTERI</name>
              <description>Time rewrite error interrupt flag bit </description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTALI" -->
            <field>
              <name>INTALI</name>
              <description>Alarm interrupt flag bit</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTTMI" -->
            <field>
              <name>INTTMI</name>
              <description>Timer interrupt flag bit </description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTHI" -->
            <field>
              <name>INTHI</name>
              <description>1-hour interrupt flag bit </description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTMI" -->
            <field>
              <name>INTMI</name>
              <description>1-minute interrupt flag bit</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTSI" -->
            <field>
              <name>INTSI</name>
              <description>1-second interrupt flag bit </description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTSSI" -->
            <field>
              <name>INTSSI</name>
              <description>0.5-second interrupt flag bit</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "YEN" -->
            <field>
              <name>YEN</name>
              <description>Alarm year register enable bit </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOEN" -->
            <field>
              <name>MOEN</name>
              <description>Alarm month register enable bit </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DEN" -->
            <field>
              <name>DEN</name>
              <description>Alarm date register enable bit </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HEN" -->
            <field>
              <name>HEN</name>
              <description>Alarm hour register enable bit</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MIEN" -->
            <field>
              <name>MIEN</name>
              <description>Alarm minute register enable bit</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BUSY" -->
            <field>
              <name>BUSY</name>
              <description>Busy bit</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SCRST" -->
            <field>
              <name>SCRST</name>
              <description>Sub second generation/1-second generation counter reset bit </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCST" -->
            <field>
              <name>SCST</name>
              <description>1-second clock output stop bit </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRST" -->
            <field>
              <name>SRST</name>
              <description>RTC reset bit </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RUN" -->
            <field>
              <name>RUN</name>
              <description>RTC count block operation bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ST" -->
            <field>
              <name>ST</name>
              <description>Start bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTCR2" -->
        <register>
          <name>WTCR2</name>
          <description>Control Register 2</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000701</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TMRUN" -->
            <field>
              <name>TMRUN</name>
              <description>Timer counter operation bit</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TMEN" -->
            <field>
              <name>TMEN</name>
              <description>Timer counter control bit</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TMST" -->
            <field>
              <name>TMST</name>
              <description>Timer counter start bit </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CREAD" -->
            <field>
              <name>CREAD</name>
              <description>Year/month/date/hour/minute/second/day of the week counter value read control bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
